package mianxiangduixiang;

public class TestDemo {
    /*
    面向对象
    以对象为基础
    强调直接以是事物本质为中心来解决
     */

    /*
    面向过程
    以过程为基础
    强调解决问题的过程
     */

    /*
    面向对象基本概念
        抽象：是无形的 只考虑与问题域相关的信息，而忽略与问题域不相关的部分

        对象：是系统中用来描述客观事物的一个实体 可以是有形的，也可以是无形的
     */

    /*
    类(class)
    是一组具有相同属性和行为的对象的抽象  类的作用是用来创建对象
    把相似的对象划归成一个类

    对象：实例化的对象
     */

    /*
    面向对象的基本特征
        封装：把对象的属性和行为结合在一个独立的系统单位内部

        继承(extends)：继承性是子类自动共享父类属性和方法的机制

        多态：指同一个命名可具有不同的语义
     */


    /*
    类的定义
        修饰符一般为public，也可以没有修饰符。
        注意类名的命名规范。类名一般大写
        类的成员：
        成员变量（属性）
        成员方法（方法）
        嵌套类
        通过“.”调用属性和方法、
     */

    /*
    构造器（构造方法/构造器，Constructor）
        具有与类相同的名称
        不含返回值类型
        不能在方法中用return语句返回一个值
        一般访问权限为public
            在一个类中，具有上述特征的方法就是构造器。
     */

}
